cases/Cavity_SOM_005/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    cellsToRefine;
        type    cellSet;
        action  new;
        source  nearestToCell;

        points
        (
            (0.0012500000 0.0987500000 0.0050000000)
            (0.0987500000 0.0987500000 0.0050000000)
            (0.0037500000 0.0987500000 0.0050000000)
            (0.0962500000 0.0987500000 0.0050000000)
            (0.0062500000 0.0987500000 0.0050000000)
            (0.0012500000 0.0962500000 0.0050000000)
            (0.0062500000 0.0962500000 0.0050000000)
            (0.0087500000 0.0987500000 0.0050000000)
            (0.0087500000 0.0962500000 0.0050000000)
            (0.0987500000 0.0937500000 0.0050000000)
            (0.0987500000 0.0962500000 0.0050000000)
            (0.0987500000 0.0912500000 0.0050000000)
            (0.0112500000 0.0962500000 0.0050000000)
            (0.0937500000 0.0987500000 0.0050000000)
            (0.0987500000 0.0887500000 0.0050000000)
            (0.0012500000 0.0937500000 0.0050000000)
            (0.0037500000 0.0962500000 0.0050000000)
            (0.0587500000 0.0987500000 0.0050000000)
            (0.0612500000 0.0987500000 0.0050000000)
            (0.0562500000 0.0987500000 0.0050000000)
            (0.0637500000 0.0987500000 0.0050000000)
            (0.0537500000 0.0987500000 0.0050000000)
            (0.0662500000 0.0987500000 0.0050000000)
            (0.0137500000 0.0962500000 0.0050000000)
            (0.0512500000 0.0987500000 0.0050000000)
            (0.0687500000 0.0987500000 0.0050000000)
            (0.0287500000 0.0987500000 0.0050000000)
            (0.0487500000 0.0987500000 0.0050000000)
            (0.0462500000 0.0987500000 0.0050000000)
            (0.0712500000 0.0987500000 0.0050000000)
            (0.0312500000 0.0987500000 0.0050000000)
            (0.0437500000 0.0987500000 0.0050000000)
            (0.0737500000 0.0987500000 0.0050000000)
            (0.0412500000 0.0987500000 0.0050000000)
            (0.0337500000 0.0987500000 0.0050000000)
            (0.0262500000 0.0987500000 0.0050000000)
            (0.0387500000 0.0987500000 0.0050000000)
            (0.0362500000 0.0987500000 0.0050000000)
            (0.0762500000 0.0987500000 0.0050000000)
            (0.0837500000 0.0987500000 0.0050000000)
            (0.0787500000 0.0987500000 0.0050000000)
            (0.0987500000 0.0862500000 0.0050000000)
            (0.0812500000 0.0987500000 0.0050000000)
            (0.0937500000 0.0962500000 0.0050000000)
            (0.0862500000 0.0987500000 0.0050000000)
            (0.0112500000 0.0987500000 0.0050000000)
            (0.0162500000 0.0962500000 0.0050000000)
            (0.0237500000 0.0987500000 0.0050000000)
            (0.0912500000 0.0962500000 0.0050000000)
            (0.0012500000 0.0912500000 0.0050000000)
            (0.0987500000 0.0837500000 0.0050000000)
            (0.0987500000 0.0737500000 0.0050000000)
            (0.0187500000 0.0962500000 0.0050000000)
            (0.0912500000 0.0812500000 0.0050000000)
            (0.0962500000 0.0962500000 0.0050000000)
            (0.0987500000 0.0762500000 0.0050000000)
            (0.0987500000 0.0812500000 0.0050000000)
            (0.0212500000 0.0962500000 0.0050000000)
            (0.0937500000 0.0862500000 0.0050000000)
            (0.0987500000 0.0787500000 0.0050000000)
            (0.0912500000 0.0787500000 0.0050000000)
            (0.0212500000 0.0987500000 0.0050000000)
            (0.0987500000 0.0712500000 0.0050000000)
            (0.0887500000 0.0962500000 0.0050000000)
            (0.0162500000 0.0937500000 0.0050000000)
            (0.0937500000 0.0837500000 0.0050000000)
            (0.0187500000 0.0937500000 0.0050000000)
            (0.0912500000 0.0837500000 0.0050000000)
            (0.0137500000 0.0937500000 0.0050000000)
            (0.0887500000 0.0762500000 0.0050000000)
            (0.0887500000 0.0987500000 0.0050000000)
            (0.0112500000 0.0937500000 0.0050000000)
            (0.0987500000 0.0687500000 0.0050000000)
            (0.0887500000 0.0737500000 0.0050000000)
            (0.0012500000 0.0887500000 0.0050000000)
            (0.0887500000 0.0787500000 0.0050000000)
            (0.0962500000 0.0862500000 0.0050000000)
            (0.0912500000 0.0762500000 0.0050000000)
            (0.0962500000 0.0837500000 0.0050000000)
            (0.0137500000 0.0987500000 0.0050000000)
            (0.0937500000 0.0887500000 0.0050000000)
            (0.0187500000 0.0987500000 0.0050000000)
            (0.0237500000 0.0962500000 0.0050000000)
            (0.0937500000 0.0812500000 0.0050000000)
            (0.0212500000 0.0937500000 0.0050000000)
            (0.0962500000 0.0812500000 0.0050000000)
            (0.0312500000 0.0937500000 0.0050000000)
            (0.0837500000 0.0937500000 0.0050000000)
            (0.0962500000 0.0887500000 0.0050000000)
            (0.0987500000 0.0662500000 0.0050000000)
            (0.0087500000 0.0937500000 0.0050000000)
            (0.0887500000 0.0887500000 0.0050000000)
            (0.0337500000 0.0937500000 0.0050000000)
            (0.0812500000 0.0862500000 0.0050000000)
            (0.0737500000 0.0912500000 0.0050000000)
            (0.0512500000 0.0912500000 0.0050000000)
            (0.0962500000 0.0787500000 0.0050000000)
            (0.0837500000 0.0862500000 0.0050000000)
            (0.0912500000 0.0862500000 0.0050000000)
            (0.0937500000 0.0912500000 0.0050000000)
            (0.0237500000 0.0937500000 0.0050000000)
            (0.0287500000 0.0937500000 0.0050000000)
            (0.0162500000 0.0987500000 0.0050000000)
            (0.0962500000 0.0712500000 0.0050000000)
            (0.0912500000 0.0912500000 0.0050000000)
            (0.0887500000 0.0812500000 0.0050000000)
            (0.0862500000 0.0937500000 0.0050000000)
            (0.0887500000 0.0712500000 0.0050000000)
            (0.0812500000 0.0837500000 0.0050000000)
            (0.0937500000 0.0937500000 0.0050000000)
            (0.0262500000 0.0937500000 0.0050000000)
            (0.0962500000 0.0762500000 0.0050000000)
            (0.0487500000 0.0912500000 0.0050000000)
            (0.0962500000 0.0737500000 0.0050000000)
            (0.0862500000 0.0712500000 0.0050000000)
            (0.0962500000 0.0912500000 0.0050000000)
            (0.0537500000 0.0912500000 0.0050000000)
            (0.0862500000 0.0737500000 0.0050000000)
            (0.0637500000 0.0962500000 0.0050000000)
            (0.0612500000 0.0962500000 0.0050000000)
            (0.0712500000 0.0912500000 0.0050000000)
            (0.0912500000 0.0887500000 0.0050000000)
            (0.0912500000 0.0987500000 0.0050000000)
            (0.0662500000 0.0962500000 0.0050000000)
            (0.0587500000 0.0962500000 0.0050000000)
            (0.0987500000 0.0637500000 0.0050000000)
            (0.0937500000 0.0787500000 0.0050000000)
            (0.0687500000 0.0812500000 0.0050000000)
            (0.0912500000 0.0737500000 0.0050000000)
            (0.0662500000 0.0812500000 0.0050000000)
            (0.0762500000 0.0912500000 0.0050000000)
            (0.0762500000 0.0837500000 0.0050000000)
            (0.0562500000 0.0912500000 0.0050000000)
            (0.0562500000 0.0962500000 0.0050000000)
            (0.0687500000 0.0962500000 0.0050000000)
            (0.0012500000 0.0862500000 0.0050000000)
            (0.0862500000 0.0687500000 0.0050000000)
            (0.0687500000 0.0912500000 0.0050000000)
            (0.0787500000 0.0837500000 0.0050000000)
            (0.0462500000 0.0912500000 0.0050000000)
            (0.0262500000 0.0962500000 0.0050000000)
            (0.0962500000 0.0937500000 0.0050000000)
            (0.0862500000 0.0762500000 0.0050000000)
            (0.0587500000 0.0912500000 0.0050000000)
            (0.0362500000 0.0937500000 0.0050000000)
            (0.0662500000 0.0912500000 0.0050000000)
            (0.0537500000 0.0962500000 0.0050000000)
            (0.0612500000 0.0912500000 0.0050000000)
            (0.0637500000 0.0912500000 0.0050000000)
            (0.0862500000 0.0862500000 0.0050000000)
            (0.0712500000 0.0962500000 0.0050000000)
            (0.0887500000 0.0837500000 0.0050000000)
            (0.0962500000 0.0687500000 0.0050000000)
            (0.0712500000 0.0812500000 0.0050000000)
            (0.0437500000 0.0912500000 0.0050000000)
            (0.0837500000 0.0887500000 0.0050000000)
            (0.0862500000 0.0887500000 0.0050000000)
            (0.0787500000 0.0912500000 0.0050000000)
            (0.0512500000 0.0962500000 0.0050000000)
            (0.0837500000 0.0912500000 0.0050000000)
        );
    }
);

// ************************************************************************* //
